import streamlit as st


r"""
# Консервативные схемы второго порядка аппроксимации по времени для задач гидродинамики в приближении мелкой воды

## Новизна

- Использование новых переменных в задачах
  гидродинамики, которые обеспечивают
  неотрицательность плотности.
- Выполнение законов сохранения на дискретном
  уровне.
- Применение безусловно устойчивых (в линейном
  случае) схем второго порядка по времени.
- Удобная вычислительная реализация за счет
  развязывания отдельных уравнений системы.
"""
