import streamlit as st


r"""
# Консервативные схемы второго порядка аппроксимации по времени для задач гидродинамики в приближении мелкой воды

## Задачи по диссертации

1. Математические модели мелкой воды
2. Аппроксимации по времени и пространству
3. Программная реализация для задач с плоским дном и
   без учета силы Кориолиса и демонстрация
   работоспособности
4. Численные эксперименты верификации
   вычислительного алгоритма и прикладного ПО на
   тестовых задачах
5. Реализация и результаты моделирования при
   использовании более общих моделей мелкой воды
   (рельеф дна, сила Кориолиса)
"""
