import streamlit as st

r'''
## Исследование схем с весами для одномерных уравнений мелкой воды

- Закон сохранения полной механической энергии выполняется приближенно и дисбаланс зависит от весового параметра.
  Наилучшее выполнение достигается на симметричной схеме.
- В качестве монотонизатора выступает вес. При увеличении $\sigma$ нефизичные осцилляции подавляются.
  В задаче с негладким решением немонотонность приближенного решения приводит к тому, что при малых $\sigma$ расчеты выполнить не удается.
'''
