import streamlit as st

r'''
## Неявные схемы для задач гидродинамики в приближении мелкой воды

Проблема исследования заключается в разработке численных методов для решения задач гидродинамики, обеспечивающих устойчивость приближенного решения и сохранение основных свойств дифференциальной задачи, таких как положительность решения и консервативность.

Актуальность исследования заключается в том, что модели сжимаемой жидкости широко применяются в различных областях, что делает моделирование критически важным. Кроме того, современные вычислительные ресурсы и методы позволяют более глубоко исследовать процессы и разрабатывать более точные и эффективные численные методы.

Цель исследования заключается в разработке вычислительного алгоритма второго порядка аппроксимации по времени.

Задачи исследования включают в себя программную реализацию алгоритма и его верификацию для численного решения задач гидродинамики в приближении мелкой воды.
'''
